Veen_OpenFOAM_Cases-main/PorousMedia/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*|
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  8                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

//coord
xmin    -1;
xmax    1;
ymin    -1;
ymax    1;
zmin    -1;
zmax    1;
nx    20;
ny    20;
nz    20;

vertices
(
    ( $xmin $ymin $zmin )
    ( $xmax $ymin $zmin )
    ( $xmax $ymax $zmin )
    ( $xmin $ymax $zmin )
    ( $xmin $ymin $zmax )
    ( $xmax $ymin $zmax )
    ( $xmax $ymax $zmax )
    ( $xmin $ymax $zmax )
);

blocks
(
    hex (0 1 2 3 4 5 6 7) fluid ( $nx $ny $nz ) simpleGrading (1 1 1)
);

edges
(
);

defaultPatch
{
    type empty;
    name default;
}

boundary
(
);

mergePatchPairs
(
);
// ************************************************************************* //
