Veen_OpenFOAM_Cases-main/PorousMedia/constant/porosityProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      porosityProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

porosity1
{
    type            DarcyForchheimer;

    cellZone        porous;

    d   (0 1e4 0);
    f   (0 0 0);

    coordinateSystem
    {
        y          (0 1 0);
        z          (0 0 1);
		type       cartesian;
		origin     (0 0 0);
		coordinateRotation
		{
			type   axesRotation;
			e2     $y;
			e3     $z;
		}
    }
}


// ************************************************************************* //
