Veen_OpenFOAM_Cases-main/PorousMedia/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

probes
{
    type            probes;
    libs            ("libsampling.so");
    writeControl    timeStep;
    writeInterval   1;

    fields
    (
        p U
    );

    probeLocations
    (
        (0 0 0) 
        (0 -0.1 0)
        (0 0.1 0)
        (0 -0.2 0)
        (0 0.2 0)          
    );

}

// ************************************************************************* //
