Veen_OpenFOAM_Cases-main/PorousMedia/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*|
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  8                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    porous;
        type    cellZoneSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-0.40 -0.04 -0.40) (0.40 0.04 0.40);
        }
    }
);
// ************************************************************************* //